InformationRegisters/ЛогТелеграммБота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЛогТелеграммБота</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТелеграммID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СЛ_Уровни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СЛ_Уровни</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Критично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйПароль</Name>
					<Comment>Используется только для ввода нового пароля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходРазрешен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРоли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/БазаЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>БазаЗнаний</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформацииБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тег</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТгБотОбработчик/Ext/Module.bsl
// Обрабатывает новые сообщения в режиме реального времени.
Процедура ОбработатьСообщениеРеалтайм() Экспорт
	ОбработатьНовыеСообщения();
КонецПроцедуры

// Обрабатывает новые сообщения.
Процедура ОбработатьНовыеСообщения()  Экспорт
	Попытка
	ТгБотКалендарь.ПроверитьНапоминанияБазыЗнаний();	
Исключение
	СЛ_ЛогированиеСервер.Зафиксировать("ТгБот.Ошибка.Напоминания",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка при проверке напоминаний: " + ОписаниеОшибки()
		);
		КонецПопытки;
	ТекстJSON = ТгБотКлиент.ПолучитьОбновленияБота();
	Если ПустаяСтрока(ТекстJSON) Тогда Возврат; КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Данные = Неопределено;
	Попытка
	Данные = ПрочитатьJSON(Чтение);
	Исключение
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.ПарсингJSON",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка парсинга JSON: " + ОписаниеОшибки()
			);
		Чтение.Закрыть();
	Возврат;
	КонецПопытки;
	Чтение.Закрыть();
	
	Если Данные.ok И Данные.result.Количество()> 0 Тогда
		Для Каждого Обновление из Данные.result Цикл
			Попытка
			Сообщение = Обновление.message;
			АвторID = Сообщение.from.id;
			
			Имя = Сообщение.from.first_name;
			ЛогинТг = ""; 
			Если Сообщение.from.Свойство("username") Тогда
				ЛогинТг = " (@" + Сообщение.from.username + ")";
				КонецЕсли;
                
Если Сообщение.Свойство("photo") Тогда
    ТекстПодписи = "";
    Если Сообщение.Свойство("caption") Тогда
        ТекстПодписи = Сообщение.caption;
    КонецЕсли;
    Если Найти(ТекстПодписи, "#") > 0 Тогда
        МассивФото = Сообщение.photo;
        ФайлID = МассивФото[МассивФото.Количество() - 1].file_id;
        // Вызываем сохранение
        ТгБотКлиент.ОбработатьФотоИзТГ(ФайлID, ТекстПодписи, АвторID);
    Иначе
         ТгБотКлиент.ОтправитьСообщение(АвторID, " Вижу фото, но без тега сохранять не буду.");
    КонецЕсли;
		ИначеЕсли Сообщение.Свойство("text") Тогда
    		ТекстКоманды = Сообщение.text; 
		ПользовательСсылка = Справочники.Пользователи.НайтиПоРеквизиту("ТелеграмID", Формат(АвторID, "ЧГ=0"));
		ДопДанныеПроверки = Новый Структура;
		ДопДанныеПроверки.Вставить("АвторIDТип", ТипЗнч(АвторID));
		ДопДанныеПроверки.Вставить("АвторIDЗначение", АвторID);
		ДопДанныеПроверки.Вставить("АвторIDСтрока", Строка(АвторID));
		ПользовательСсылка = Справочники.Пользователи.НайтиПоРеквизиту("ТелеграмID", Формат(АвторID, "ЧГ=0"));
		ДопДанныеПроверки.Вставить("ПользовательНайден", НЕ ПользовательСсылка.Пустая());
		СЛ_ЛогированиеСервер.Зафиксировать(
	    "ТгБот.ПроверкаДоступа",
	    Перечисления.СЛ_Уровни.Информация,
	    "Проверка пользователя Telegram",
	    ДопДанныеПроверки
		);
		Если НЕ ПользовательСсылка.Пустая() Тогда
			    ДопДанныеУспеха = Новый Структура;
			    ДопДанныеУспеха.Вставить("Пользователь", ПользовательСсылка);
			    ДопДанныеУспеха.Вставить("ТелеграмIDВДанных", ПользовательСсылка.ТелеграмID);
			    ДопДанныеУспеха.Вставить("ВходРазрешен", ПользовательСсылка.ВходРазрешен);
			    СЛ_ЛогированиеСервер.Зафиксировать(
			        "ТгБот.ПользовательНайден",
			        Перечисления.СЛ_Уровни.Информация,
			        "Данные найденного пользователя",
			        ДопДанныеУспеха
			    );
			Если ПользовательСсылка.ВходРазрешен = Истина Тогда 
       			 АнализироватьКоманду(ТекстКоманды, АвторID);
				 Попытка
       			 ТгБотКалендарь.ПроверитьКалендарьИЗадачи(АвторID);
			 Исключение
				 ПараметрыЛога = Новый Структура("ТелеграмID, Команда", АвторID, ТекстКоманды);
				 СЛ_ЛогированиеСервер.Зафиксировать(
								"ТгБот.Ошибка.Календарь",
								Перечисления.СЛ_Уровни.Ошибка,
								"Ошибка проверки календаря: " + ОписаниеОшибки(),
								ПараметрыЛога
							);
						КонецПопытки;
				Иначе
        			ТгБотКлиент.ОтправитьСообщение(АвторID, "Ваш доступ временно приостановлен.");
    			КонецЕсли;
			Иначе
			ПолноеИмя = Имя + ЛогинТг;
			Менеджер = РегистрыСведений.ЛогТелеграммБота.СоздатьМенеджерЗаписи();
			Менеджер.ДатаСобытия = ТекущаяДата();
			Менеджер.ТелеграммID = АвторID;
			Менеджер.ИмяПользователя = ПолноеИмя;
			Менеджер.ТипЗапроса = ТекстКоманды;
			Менеджер.ТипСобытия = "Попытка взлома";
			Менеджер.Записать();
			ТгБотКлиент.ОтправитьСообщение(АвторID, "Доступ запрещён");
			КонецЕсли;
			Константы.ПоследнийНомерСообщенияТГ.Установить(Обновление.update_id + 1);
		
			КонецЕсли;
		Исключение
		ПараметрыЛога = Новый Структура("ТелеграмID, ОбновлениеID", АвторID, Обновление.update_id);
				СЛ_ЛогированиеСервер.Зафиксировать(
					"ТгБот.Ошибка.ОбработкаСообщения",
					Перечисления.СЛ_Уровни.Ошибка,
					,
					"Ошибка обработки сообщения: " + ОписаниеОшибки(),
					ПараметрыЛога
				);
				ТгБотКлиент.ОтправитьСообщение(АвторID, "❌ Произошла ошибка при обработке сообщения. Администратор оповещен.");
				КонецПопытки;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры   

// Анализирует текст команды от пользователя Telegram-бота и выполняет соответствующие действия: сохраняет заметку с тегом в Базу Знаний или обрабатывает служебные команды (стартовые сообщения, отчеты, календарь, задачи).
//
// Параметры:
//   ТекстКоманды - Строка - текст сообщения, полученный от пользователя
//   ЧатID - Строка, Число - уникальный идентификатор чата с пользователем
Процедура АнализироватьКоманду(ТекстКоманды, ЧатID)
	ТекстВРег = ВРег(СокрЛП(ТекстКоманды));
#Область Хэштег
ПозТега = Найти(ТекстКоманды, "#");
Если ПозТега > 0 Тогда
	 ТекПользователь = ТгБотСервисы.ОпределитьПользователяПоID(ЧатID);
    ИмяТега = ТгБотСервисы.ОпределитьИмяТегаПоТексту(ТекстКоманды);
    ТипИнфо = ТгБотСервисы.ОпределитьТипИнформацииПоТексту(ИмяТега);    
    ТекстБезТега = СокрЛП(СтрЗаменить(ТекстКоманды, "#" + ИмяТега, ""));
    НоваяЗаметка = Справочники.БазаЗнаний.СоздатьЭлемент();
    НоваяЗаметка.Наименование = Лев(ТекстБезТега, 100); // Краткий заголовок
    НоваяЗаметка.Содержание  = ТекстБезТега;
    НоваяЗаметка.ТипИнформации = ТипИнфо;
    НоваяЗаметка.Тег           = ИмяТега;
    НоваяЗаметка.Пользователь = ТекПользователь;
    НоваяЗаметка.ДатаДобавления = ТекущаяДата();
    
    Попытка
        НоваяЗаметка.Записать();
        ТгБотКлиент.ОтправитьСообщение(ЧатID, " Сохранено в Базу Знаний (" + ТипИнфо + ")");
        Возврат; 
    Исключение
        ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при сохранении заметки!");
    КонецПопытки;    
КонецЕсли;
#КонецОбласти

#Область Команды
	Если ТекстВРег = "/START" Тогда
		Меню = " Привет! Я твой помощник 1С." + Символы.ПС +
		       "Вот что я умею:" + Символы.ПС + Символы.ПС +
		       " /ExchangeRate — Курсы валют от ЦБ" + Символы.ПС +
		       " /Report — Твои расходы (План/Факт)" + Символы.ПС +
			  " /DetailedReport — Твои расходы по категориям" + Символы.ПС +
			  " /Dynamics — Динамика расходов к плану" + Символы.ПС +
			  " /Calendar — Календарь" + Символы.ПС +
		  	  " /Tasks — Задачи и напоминания в календарь" + Символы.ПС +
			  " /Статус — Состояние системы" + Символы.ПС +
		       " /Логи — Попытки чужого доступа" + Символы.ПС + Символы.ПС +
		       "Выбери команду или просто напиши её!";
		ТгБотКлиент.ОтправитьСообщение(ЧатID, Меню);
		
	ИначеЕсли ТекстВРег = "/EXCHANGERATE" Тогда 
		Попытка
		ТекстОтвета = ТгБотОтчеты.ПолучитьТекстКурсаДляТг();
		ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета);
		Исключение
		ПараметрыЛога = Новый Структура("ТелеграмID, Команда", ЧатID, ТекстКоманды);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.КурсВалют",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка получения курса валют: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при получении курса валют. Попробуйте позже.");
		КонецПопытки;
	
	ИначеЕсли ТекстВРег = "/REPORT" Тогда
	Попытка
		
		ТекстОтвета = ТгБотОтчеты.СформироватьОтчетИзРегистраИтоги(ЧатID);
		 ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета);
	 Исключение
		 ПараметрыЛога = Новый Структура("ТелеграмID, Команда", ЧатID, ТекстКоманды);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.ОтчетОбщий",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка формирования отчета: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при формировании отчета. Попробуйте позже.");
	КонецПопытки;
	
	ИначеЕсли ТекстВРег = "/DETAILEDREPORT" Тогда
		Попытка
		ТекстОтвета = ТгБотОтчеты.СформироватьОтчётКатегорийИтоги(ЧатID);
		 ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета) 
		Исключение
		ПараметрыЛога = Новый Структура("ТелеграмID, Команда", ЧатID, ТекстКоманды);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.ОтчетДетальный",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка формирования детального отчета: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при формировании отчета. Попробуйте позже.");
	КонецПопытки;
	
	ИначеЕсли ТекстВРег = "/DYNAMICS" Тогда
		Попытка
		ТекстОтвета = ТгБотОтчеты.СформироватьПрогнозТемпа(ЧатID);
		 ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета)
		Исключение
		ПараметрыЛога = Новый Структура("ТелеграмID, Команда", ЧатID, ТекстКоманды);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.Прогноз",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка формирования прогноза: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при формировании прогноза. Попробуйте позже.");
	КонецПопытки;
	
	ИначеЕсли ТекстВРег = "/CALENDAR" Тогда
		Попытка
		ТекстОтвета = ТгБотКалендарь.СформироватьКалендарь();
		 ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета)
		Исключение 
		 ПараметрыЛога = Новый Структура("ТелеграмID, Команда", ЧатID, ТекстКоманды);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.Календарь",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка формирования календаря: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при формировании календаря. Попробуйте позже.");
		КонецПопытки;	
	ИначеЕсли ТекстВРег = "/TASKS" Тогда
		Попытка
		ТекстОтвета = " Список команд для задач в календаре" + Символы.ПС + Символы.ПС+
		"/ShowTasks - показать существующие задачи" + Символы.ПС +
		"/Add - Добавить в колендарь" +  Символы.ПС +
		"Пример: /Add Покормить кота 18.04.2026 19:00 ЗаЧас Ежедневно Пользователь" +  Символы.ПС +
		"Типы Напоминаний: За15Минут, ЗаЧас,  ЗаДень" +  Символы.ПС +
		"Типы Периодичности: Нет, Ежедневно, Еженедельно, Ежемесячно";
		 ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета) 
	 Исключение
		 ПараметрыЛога = Новый Структура("ТелеграмID, Команда", ЧатID, ТекстКоманды);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.Задачи",
			Перечисления.СЛ_Уровни.Ошибка,
			,
						"Ошибка формирования календаря: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка. Попробуйте позже.");
	КонецПопытки;
		
	ИначеЕсли Лев(ТекстВРег, 4) = "/ADD" Тогда
	Попытка
		 ВходнаяСтрока = СокрЛП(Сред(ТекстКоманды, 5));
		ТекстОтвета = ТгБотКалендарь.ДобавитьЗадачуТг(ВходнаяСтрока, ЧатID);
		 ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета);	 
	Исключение
		ПараметрыЛога = Новый Структура("ТелеграмID, Команда, Данные", ЧатID, ТекстКоманды, ВходнаяСтрока);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.ДобавитьЗадачу",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка добавления задачи: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при добавлении задачи. Проверьте формат команды.");
	КонецПопытки;
	
	ИначеЕсли Лев(ТекстВРег, 6) = "/DONE_" Тогда
		Попытка
		КодЗадачи = Сред(ТекстКоманды, 7);
		ТекстОтвета = ТгБотКалендарь.ВыполнитьЗадачуТг(КодЗадачи);
		 ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета);
		 Исключение
		ПараметрыЛога = Новый Структура("ТелеграмID, Команда, КодЗадачи", ЧатID, ТекстКоманды, КодЗадачи);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.ВыполнитьЗадачу",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка выполнения задачи: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при выполнении задачи. Попробуйте позже.");
	КонецПопытки;
	
	ИначеЕсли Лев(ТекстВРег, 10) = "/POSTPONE_" Тогда
		Попытка
		КодЗадачи = Сред(ТекстКоманды, 11);
		ТекстОтвета = ТгБотКалендарь.ОтложитьЗадачуТг(КодЗадачи);
		 ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета);
		 Исключение
		ПараметрыЛога = Новый Структура("ТелеграмID, Команда, КодЗадачи", ЧатID, ТекстКоманды, КодЗадачи);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.ОтложитьЗадачу",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка отложения задачи: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при отложении задачи. Попробуйте позже.");
	КонецПопытки;
	
	ИначеЕсли ТекстВРег = "/SHOWTASKS" Тогда
		Попытка
		ТекстОтвета = ТгБотКалендарь.ПолучитьСписокЗадачТг();
		 ТгБотКлиент.ОтправитьСообщение(ЧатID, ТекстОтвета);	 
		Исключение
		ПараметрыЛога = Новый Структура("ТелеграмID, Команда", ЧатID, ТекстКоманды);
		СЛ_ЛогированиеСервер.Зафиксировать(
			"ТгБот.Ошибка.СписокЗадач",
			Перечисления.СЛ_Уровни.Ошибка,
			,
			"Ошибка получения задач: " + ОписаниеОшибки(),
			ПараметрыЛога
		);
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "❌ Ошибка при получении списка задач. Попробуйте позже.");
	КонецПопытки;
	
	Иначе
		ТгБотКлиент.ОтправитьСообщение(ЧатID, "Пока не знаю такой команды");
	КонецЕсли;
#КонецОбласти
КонецПроцедуры
